artifacts/contracts/soap/examples/candidate-field-workorder-create-request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wor="http://demo.telco.wso2.com/workorder">
  <soapenv:Header/>
  <soapenv:Body>
    <wor:CreateWorkOrderRequest>
      <wor:customerId>CUST-10001</wor:customerId>
      <wor:siteId>BR-SP-EDGE-03</wor:siteId>
      <wor:priority>HIGH</wor:priority>
      <wor:description>Field technician required for site inspection.</wor:description>
    </wor:CreateWorkOrderRequest>
  </soapenv:Body>
</soapenv:Envelope>
